Project/Toir/src/Catalogs/торо_ВидыСкользящихПланов/торо_ВидыСкользящихПланов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ВидыСкользящихПланов</name>
  <predefined>
    <items>
      <name>Годовой</name>
      <description>Годовой</description>
    </items>
    <items>
      <name>Долгосрочный</name>
      <description>Долгосрочный</description>
    </items>
    <items>
      <name>Оперативный</name>
      <description>Оперативный</description>
    </items>
    <items>
      <name>Среднесрочный</name>
      <description>Среднесрочный</description>
    </items>
    <items>
      <name>Стратегический</name>
      <description>Стратегический</description>
    </items>
  </predefined>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоОтображаемыхПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьПланирования</name>
    <type>
      <types>EnumRef.торо_ДетализацияПлана</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИсполнителяРабот</name>
    <type>
      <types>EnumRef.торо_ДетализацияИсполнителя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыРемонтов</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/торо_ВидыСкользящихПланов/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Функция - возвращает структуру значений реквизитов вида плана, переданного в параметре.
//
// Параметры:
//  ВидПлана - СправочникСсылка.торо_ВидыСкользящихПланов - Вид плана, для которого необходимо 
//															получить структуру значений реквизитов.
//
// Возвращаемое значение:
//		Структура - стркутура реквизитов справочника.
//
Функция ПолучитьДанныеПоВидуПлана(ВидПлана) Экспорт
	
	Запрос = Новый Запрос;
	# Область ТекстЗапроса
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	торо_ВидыСкользящихПлановВидыРемонтов.ВидРемонта КАК ВидРемонта
	               |ИЗ
	               |	Справочник.торо_ВидыСкользящихПланов.ВидыРемонтов КАК торо_ВидыСкользящихПлановВидыРемонтов
	               |ГДЕ
	               |	торо_ВидыСкользящихПлановВидыРемонтов.Ссылка = &ВидПлана
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ВидыСкользящихПланов.ПериодичностьПланирования КАК Периодичность,
	               |	торо_ВидыСкользящихПланов.ЧислоОтображаемыхПериодов КАК КоличествоПериодов,
	               |	торо_ВидыСкользящихПланов.ТочностьПланирования КАК Детализация,
	               |	торо_ВидыСкользящихПланов.ВидИсполнителяРабот КАК ВидИсполнителяРабот
	               |ИЗ
	               |	Справочник.торо_ВидыСкользящихПланов КАК торо_ВидыСкользящихПланов
	               |ГДЕ
	               |	торо_ВидыСкользящихПланов.Ссылка = &ВидПлана";
	# КонецОбласти
	Запрос.УстановитьПараметр("ВидПлана", ВидПлана);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Массив = РезультатЗапроса[0].Выгрузить().ВыгрузитьКолонку("ВидРемонта");
	
	СтруктураВозврата = Новый Структура("Периодичность, КоличествоПериодов, Детализация, ВидИсполнителяРабот");
	
    Если Не РезультатЗапроса[1].Пустой() Тогда
		Выборка = РезультатЗапроса[1].Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЕсли; 
	
	СтруктураВозврата.Вставить("МассивРемонтов", Массив);
	
	Возврат СтруктураВозврата;	
	
КонецФункции
   	
#КонецОбласти
